"""
++++++++++++++++++++++++++++++++++++++++++++++++
Словари в Python (dict)
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1.Создайте словарь, в котором хранятся названия фруктов и их цены за 1 кг.
Добавьте в словарь еще один фрукт и выведите итоговый словарь.
==============================================="""

# fruits = {"apple" : 120, "banana" : 80, "mango" : 300}
#
# print(fruits)
#
# fruits["melon"] = 30
#
# print(fruits)

"""2. Дан словарь с оценками студентов:
grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
Выведите имена студентов, у которых оценка не ниже 4.
==============================================="""

# grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
#
# for key, value in grades.items():
#     if value >= 4:
#         print(key, end='  ')

"""3. Создайте словарь, содержащий название стран в качестве ключей и их столицы в качестве значений.
Пользователь вводит название страны.
Выведите столицу этой страны (если страна отсутствует в словаре, выведите "Страна не найдена").
==============================================="""

# countries = dict(Россия="Москва", Беларусь="Минск", Турция="Анкара")
#
# print(countries.get(input("Введите название страны: "), "Страна не найдена"))

"""4. Дан список студентов и их курсов:
students = [
    ("Анна", "Python"),
    ("Борис", "Java"),
    ("Виктор", "Python"),
    ("Галина", "C++"),
    ("Дмитрий", "Python")
]
Создайте словарь, в котором ключами будут названия курсов, а значениями — списки студентов, которые изучают этот курс.
==============================================="""

# students = [
#     ("Анна", "Python"),
#     ("Борис", "Java"),
#     ("Виктор", "Python"),
#     ("Галина", "C++"),
#     ("Дмитрий", "Python")
# ]
#
# courses = dict(students)
#
# actual_courses = dict()
#
# for name, course in courses.items():
#     if course in actual_courses:
#         actual_courses[course].append(name)
#     else:
#         actual_courses[course] = [name]
#
# print(actual_courses)

"""5. Создайте словарь, содержащий оценки студентов:
Используя метод pop(), удалите студента с самой низкой оценкой и выведите обновленный словарь.
==============================================="""

# 1-ый способ:
# students = {
#     "Анна": 5,
#     "Борис" : 3,
#     "Виктор" : 4,
#     "Галина" : 5,
#     "Дмитрий" : 2
# }
#
# min_student = ''
# min_grade = float('inf')
#
# for name, grade in students.items():
#     if grade < min_grade:
#         min_grade = grade
#         min_student = name
#
# deleted_student = students.pop(min_student)
#
# print(f"Удалён студент: {min_student} с оценкой {min_grade}\nОбновлённый словарь: {students}")

# 2-ой способ:
# students = {
#     "Анна": 5,
#     "Борис" : 3,
#     "Виктор" : 4,
#     "Галина" : 5,
#     "Дмитрий" : 2
# }
#
# min_student = ''
# min_grade = students[next(iter(students))]
#
# for name, grade in students.items():
#     if grade < min_grade:
#         min_grade = grade
#         min_student = name
#
# deleted_student = students.pop(min_student)
#
# print(f"Удалён студент: {min_student} с оценкой {min_grade}\nОбновлённый словарь: {students}")

# 3-ий способ:
# students = {
#     "Анна": 5,
#     "Борис" : 3,
#     "Виктор" : 4,
#     "Галина" : 5,
#     "Дмитрий" : 2
# }
#
# min_grade = min(students.values())
# min_student = min(students, key=students.get)
#
# deleted_student = students.pop(min_student)
#
# print(f"Удалён студент: {min_student} с оценкой {min_grade}\nОбновлённый словарь: {students}")

"""6. Дан список студентов:
students = ["Анна", "Борис", "Виктор", "Галина"]
Преобразуйте этот список в словарь, заполнив значения всех студентов None. Затем обновите словарь указав в значение возраст студентов.
==============================================="""

# students = ["Анна", "Борис", "Виктор", "Галина"]
#
# dict_students = dict.fromkeys(students)
#
# print(dict_students)
#
# for name in dict_students:
#     dict_students[name] = 20
#
# print(dict_students)

"""7. Дан словарь с курсами валют:
exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
Пользователь вводит валюту (USD, EUR или GBP).
Если валюта есть в словаре, выведите ее курс, иначе выведите "Неизвестная валюта". Если валюта не известна, то
добавьте новую валюты со значением None"""

# 1-ый способ:
# exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
#
# type_money = input("Введите валюту (USD, EUR или GBP): ")
#
# if exchange_rates.get(type_money) is not None:
#     print(f"Курс валюты {type_money}: {exchange_rates[type_money]}")
# else:
#     print("Неизвестная валюта")
#     exchange_rates[type_money] = None
#     print(f"Обновлённый словарь: {exchange_rates}")

# 2-ой способ:
# exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
#
# type_money = input("Введите валюту (USD, EUR или GBP): ")
#
# updating = exchange_rates.setdefault(type_money)
#
# if updating is not None:
#     print(f"Курс валюты {type_money}: {updating}")
# else:
#     print(f"Неизвестная валюта\nОбновлённый словарь: {exchange_rates}")

"""8. Создайте два словаря:
dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
Объедините их с помощью update()."""

# dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
# dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
#
# dict1.update(dict2)
#
# print(dict1)
#
# # Можно ещё так:
# dict3 = {**dict1, **dict2}
# print(dict3)


"""+++++++++++++++++++++++++++++++++++++++++++++++
Кортежи в Python
+++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Создайте кортеж из пяти элементов (разных типов данных).
Выведите на экран второй элемент и последний элемент этого кортежа.
==============================================="""

# new_tuple = ('Python', 123, [321, 'Java'], True, {"Python": "Круто"})
#
# print(f"Второй элемент кортежа {new_tuple}: {new_tuple[1]}, последний: {new_tuple[-1]}")

"""2. Дан кортеж чисел:
nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
Выведите количество вхождений числа 4 в этом кортеже.
Найдите индекс первого вхождения числа 7.
==============================================="""

# nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
#
# print(f"Выведите количество вхождений числа 4 в кортеже {nums} равно {nums.count(4)}")
# print(f"индекс первого вхождения числа 7 равен {nums.index(4)}")

"""3. Преобразуйте следующий список в кортеж:
lst = ["Python", "Java", "C++", "JavaScript"]
После преобразования проверьте, присутствует ли в кортеже элемент "C++".
==============================================="""

# lst = ["Python", "Java", "C++", "JavaScript"]
# new_tuple = tuple(lst)
# print(new_tuple)
#
# print(f"Да, элемент C++ присутствует" if "C++" in new_tuple else "Нет, элемент C++ не присутствует")

"""4. Создайте кортеж с числами от 1 до 10.
Используя срезы, выведите:
Первые три элемента.
Последние три элемента.
Все элементы с шагом 2.
==============================================="""

# new_tuple = tuple(range(1, 11))
#
# print(f"Первые три элемента кортежа {new_tuple}: \"{new_tuple[:3]}\"")
# print(f"Последние три элемента кортежа {new_tuple}: \"{new_tuple[-3:]}\"")
# print(f"Все элементы кортежа {new_tuple} с шагом 2: \"{new_tuple[::2]}\"")


"""5. Создайте кортеж, содержащий вложенные список и словарь.
Попробуйте изменить список внутри кортежа, добавив в него новый элемент.
"""

# new_tuple = ('Python', 123, [321, 'Java'], True, {"Python": "Круто"})
#
# for a in new_tuple:
#     if type(a) is list:
#         a.append(4)
#
# print(new_tuple) #Всё работает